In [1]:
import pandas as pd
from sqlalchemy import create_engine
import logging
import sys

In [2]:
DATABASE_CONFIG = {
    'host': '10.0.2.74',
    'port': 3310,
    'user': 'root',
    'password': 'root',
    'database': 'retail_db'
}

In [3]:
def create_db_engine(config):
    """
    """
    try:
        engine = create_engine(f"mysql://{config['user']}:{config['password']}@{config['host']}:{config['port']}/{config['database']}")
        return engine
    except Exception as e:
        print(e)

In [4]:
create_db_engine(DATABASE_CONFIG)

Engine(mysql://root:***@10.0.2.74:3310/retail_db)

CONTINUACIÓN SESION 3 : ETL - EXTRACCIÓN

In [5]:
def read_csv(file_path, columns):
    """
    Lee un archivo CSV y devuelve un DataFrame
    """
    try:
        df = pd.read_csv(file_path, header=None, sep='|', names=columns)
        logging.info(f"Archivo {file_path} leido correctamente")
        return df
    except Exception as e:
        logging.error(f"Error al leer el archivo {file_path}: {e}")
        sys.exit(1)

In [6]:
df_departments =read_csv('../data/departments',['department_id','department_name'])
df_departments

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors
5              7        Fan Shop

In [7]:
def transform_departments(df):
    """
    Realiza transformaciones en el dataframe departments
    """
    if df['department_name'].duplicated().any():
        logging.warning("Hay departamentos dupplicados en del DataFrame")
        sys.exit(1) 
    return df

In [8]:
transform_departments(df_departments)

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors
5              7        Fan Shop

PARA LA SESIÓN 4, EJECUTAMOS EL DOCKER COMPOSE UP (contenedor de mysl) EN LA CARPETA QUE ESTAMOS TRABAJANDO SESION2

In [11]:
customer:
names=["customer_id","customer_fname","customer_lname","customer_email","customer_password","customer_street","customer_city","customer_state","customer_zipcode"]

order:
names=["order_id","order_date","order_customer_id","order_status"]

order_items:
names=["order_item_id","order_item_order_id","order_item_product_id","order_item_quantity","order_item_subtotal","order_item_product_price"]

department:
names=['department_id', 'department_name']

categories:
names=["category_id", "category_department_id", "category_name"]

products:
names=["product_id","product_category_id","product_name","product_description","product_price","product_image"]

SyntaxError: invalid syntax (2422369026.py, line 1)

In [9]:
def transform_customers(df):
    """
    """
    df["customer_email"]= df["customer_email"].str.lower()
    #validar campos obligatorios

    if df[["customer_fname","customer_lname","customer_email"]].isnull().any().any():
        print("Datos faltantes en el Dataframe customers")
        sys.exit(1)

    return df

In [10]:
df_customers = read_csv('../data_retail/customers', ["customer_id","customer_fname","customer_lname","customer_email","customer_password","customer_street","customer_city","customer_state","customer_zipcode"] )
df_customers.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725

In [11]:
transform_customers(df_customers)

## verificamos que sí hay una salida ya que no hay valores nulos en el dframe de customers, podemos
##hacer que sea un valor nuelo a propósito con finer prácticos

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,xxxxxxxxx,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,xxxxxxxxx,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,xxxxxxxxx,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,xxxxxxxxx,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,xxxxxxxxx,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...,...
12430,12431,Mary,Rios,xxxxxxxxx,XXXXXXXXX,1221 Cinder Pines,Kaneohe,HI,96744
12431,12432,Angela,Smith,xxxxxxxxx,XXXXXXXXX,1525 Jagged Barn Highlands,Caguas,PR,725
12432,12433,Benjamin,Garcia,xxxxxxxxx,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
12433,12434,Mary,Mills,xxxxxxxxx,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
12434,12435,Laura,Horton,xxxxxxxxx,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

In [12]:
## Vamos a validar ahora las relaciones PRODUCTOS -CATEGORIAS

def transform_products(df_products, df_categories):
    """
    """

    # Asegurar que product_category_id exista en categories
    valid_ids = set(df_categories['category_id'])

    if not df_products['product_category_id'].isin(valid_ids).all():
        print("Hay product_category_id que no existen en category")
        sys.exit(1)

    return df

In [13]:
df_products = read_csv("../data_retail/products", ["product_id","product_category_id","product_name","product_description","product_price","product_image"])
df_categories = read_csv("../data_retail/categories",["category_id", "category_department_id", "category_name"])

In [14]:
transform_products(df_products, df_categories).head()

## En la salida de esto verificamos que existe product_category_id que no está dentro de category_id, ese dato
##es el 59 si abrimos las dos tablas

Hay product_category_id que no existen en category

SystemExit: 1

/home/codespace/.local/lib/python3.12/site-packages/IPython/core/interactiveshell.py:3585: UserWarning: To exit: use 'exit', 'quit', or Ctrl-D.
  warn("To exit: use 'exit', 'quit', or Ctrl-D.", stacklevel=1)

In [15]:
customer:
names=["customer_id","customer_fname","customer_lname","customer_email","customer_password","customer_street","customer_city","customer_state","customer_zipcode"]

order:
names=["order_id","order_date","order_customer_id","order_status"]

order_items:
names=["order_item_id","order_item_order_id","order_item_product_id","order_item_quantity","order_item_subtotal","order_item_product_price"]

department:
names=['department_id', 'department_name']

categories:
names=["category_id", "category_department_id", "category_name"]

products:
names=["product_id","product_category_id","product_name","product_description","product_price","product_image"]

SyntaxError: invalid syntax (2422369026.py, line 1)

In [16]:
def transform_orders(df_products, df_order_items, df_orders):
    """
    """

    # Asegurar que "order_item_product_id" exista en "product_id"
    valid_ids_1 = set(df_products['product_id'])
    valid_ids_2 = set(df_orders['order_id'])



    if not df_order_items['order_item_product_id'].isin(valid_ids_1).all():
        print("Hay order_item_product_id que no existen en product_id")
        sys.exit(1)

    if not df_order_items['order_item_order_id'].isin(valid_ids_2).all():
        print("Hay order_item_order_id que no existen en order_id")
        sys.exit(1)

    return df_order_items

In [17]:
df_products= read_csv("../data_retail/products" ,["product_id","product_category_id","product_name","product_description","product_price","product_image"])
df_order_items=read_csv("../data_retail/order_items" ,["order_item_id","order_item_order_id","order_item_product_id","order_item_quantity","order_item_subtotal","order_item_product_price"])
df_orders=read_csv("../data_retail/orders" ,["order_id","order_date","order_customer_id","order_status"])

In [18]:
transform_orders(df_products, df_order_items, df_orders)

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [19]:
def validate_ids(df_retail, df, id_retail, id_df ):

    valid_ids = set(df[id_df])

    if not df_retail[id_retail].isin(valid_ids).all():
        print("Hay ids que no se encuentran en el DataFrame")
        sys.exit(1)

In [20]:
def transform_order_items(df, df_orders, df_products):

    # order_item_order_id exista en orders

    validate_ids(df,df_orders, 'order_item_order_id', 'order_id' )

    # order_item_product_id exista en products

    validate_ids(df,df_products, 'order_item_product_id', 'product_id' )

    return df

In [21]:
transform_order_items(df_order_items,df_orders,df_products)

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [22]:
##para asegurarnos la información de alguna operación

def transform_order_items(df, df_orders, df_products):

    # order_item_order_id exista en orders

    validate_ids(df,df_orders, 'order_item_order_id', 'order_id' )

    # order_item_product_id exista en products

    validate_ids(df,df_products, 'order_item_product_id', 'product_id' )

    calculated_subtotal= df["order_item_quantity"]*df['order_item_product_price']

    if not (df['order_item_product_price']== calculated_subtotal).all():
        df['order_item_subtotal'] = calculated_subtotal

    return df

In [23]:
transform_order_items(df_order_items,df_orders,df_products)

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

Hasta el momento, tenemos las validaciones, transformaciones, lecturas. Ahora falta ahora la carga

In [24]:
def load_data(engine, table_name, df):
    """
    """
    df.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

In [25]:
engine = create_db_engine(DATABASE_CONFIG)
load_data(engine, 'categries_2', df_categories)

##instalamos en extensiones (MySQL database managment for mysql), creamos la conexión y set estos datos:
##DATABASE_CONFIG = {
##    'host': '10.0.0.239',
##    'port': 3310,
##    'user': 'root',
##    'password': 'root',
##    'database': 'retail_db'
##}

In [26]:
## luego de estar conectado, pegamos el script para vaciar las tablas (script proporcionado por el profesor):

SCRIPT PROPORCIONADO POR EL PROFESOR: 

SET FOREIGN_KEY_CHECKS=0;
DROP TABLE IF EXISTS `departments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `departments` (
  `department_id` int(11) NOT NULL AUTO_INCREMENT,
  `department_name` varchar(45) NOT NULL,
  PRIMARY KEY (`department_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `categories`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `categories` (
  `category_id` int(11) NOT NULL AUTO_INCREMENT,
  `category_department_id` int(11) NOT NULL,
  `category_name` varchar(45) NOT NULL,
  PRIMARY KEY (`category_id`),
  CONSTRAINT `fk_category_department_id` FOREIGN KEY (`category_department_id`) REFERENCES `departments` (`department_id`)
) ENGINE=InnoDB AUTO_INCREMENT=59 DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `customers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `customers` (
  `customer_id` int(11) NOT NULL AUTO_INCREMENT,
  `customer_fname` varchar(45) NOT NULL,
  `customer_lname` varchar(45) NOT NULL,
  `customer_email` varchar(45) NOT NULL,
  `customer_password` varchar(45) NOT NULL,
  `customer_street` varchar(255) NOT NULL,
  `customer_city` varchar(45) NOT NULL,
  `customer_state` varchar(45) NOT NULL,
  `customer_zipcode` varchar(45) NOT NULL,
  PRIMARY KEY (`customer_id`)
) ENGINE=InnoDB AUTO_INCREMENT=12436 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

DROP TABLE IF EXISTS `order_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL AUTO_INCREMENT,
  `order_date` datetime NOT NULL,
  `order_customer_id` int(11) NOT NULL,
  `order_status` varchar(45) NOT NULL,
  PRIMARY KEY (`order_id`),
  CONSTRAINT `fk_order_customer_id` FOREIGN KEY (`order_customer_id`) REFERENCES `customers` (`customer_id`)
) ENGINE=InnoDB AUTO_INCREMENT=68884 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `products` (
  `product_id` int(11) NOT NULL AUTO_INCREMENT,
  `product_category_id` int(11) NOT NULL,
  `product_name` varchar(45) NOT NULL,
  `product_description` varchar(255) NULL,
  `product_price` float NOT NULL,
  `product_image` varchar(255) NOT NULL,
  PRIMARY KEY (`product_id`),
  CONSTRAINT `fk_product_category_id` FOREIGN KEY (`product_category_id`) REFERENCES `categories` (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=1346 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;


CREATE TABLE `order_items` (
  `order_item_id` int(11) NOT NULL AUTO_INCREMENT,
  `order_item_order_id` int(11) NOT NULL,
  `order_item_product_id` int(11) NOT NULL,
  `order_item_quantity` tinyint(4) NOT NULL,
  `order_item_subtotal` float NOT NULL,
  `order_item_product_price` float NOT NULL,
  PRIMARY KEY (`order_item_id`),
  CONSTRAINT `fk_order_item_order_id` FOREIGN KEY (`order_item_order_id`) REFERENCES `orders` (`order_id`),
  CONSTRAINT `fk_order_item_product_id` FOREIGN KEY (`order_item_product_id`) REFERENCES `products` (`product_id`)
) ENGINE=InnoDB AUTO_INCREMENT=172199 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

SET FOREIGN_KEY_CHECKS=1;